{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "name": "batch_normalization_1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "batch_input_shape": [null, 96, 96, 1], "beta_constraint": null, "scale": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "strides": [1, 1], "filters": 24, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "filters": 36, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "filters": 48, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "filters": 64, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_4", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_4", "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "filters": 64, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "dense_1", "activation": "relu", "use_bias": true, "bias_regularizer": null, "units": 500, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "dense_2", "activation": "relu", "use_bias": true, "bias_regularizer": null, "units": 90, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "name": "dense_3", "activation": "linear", "use_bias": true, "bias_regularizer": null, "units": 44, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.1.6"}